# IsValidFormatOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionEqualityLabelFormatting..::..IsValidFormatOptions Method
DimensionEqualityLabelFormatting Class See Also
---
Checks whether a FormatOptions object is valid for the LabelType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public bool IsValidFormatOptions()
```

Visual Basic
---
```text
Public Function IsValidFormatOptions As Boolean
```

Visual C++
---
```text
public:
bool IsValidFormatOptions()
```

# ### Return Value
True if the FormatOptions object is valid, false otherwise.
# Remarks
Only objects whose LabelType is LengthOfSegment or TotalLength can have FormatOptions assigned.
# See Also
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace